Revit 2027 API
FabricSheet.GetSheetLocation Method
 Gets the position and the orientation of the Fabric Sheet instance.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transform GetSheetLocation()
Public Function GetSheetLocation As Transform
public:
Transform^ GetSheetLocation()
member GetSheetLocation : unit -> Transform
Return Value
Transform
 The location of the Fabric Sheet instance.
See Also
Reference
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace